# 篮球检测专用YOLOv8模型
# 核心创新：浅层高分辨率特征 + DCNv3形变感知 + BGAM几何先验门控
# 针对问题：广角镜头下极小目标 + 高速运动模糊

# Parameters
nc: 1 # 只有篮球1个类别
scales: # 沿用YOLOv8原版缩放系数，确保模型大小和速度平衡
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# Backbone：在最高分辨率的P2层后插入我们的自定义模块
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0: P1/2 (输入尺寸的1/2)
  - [-1, 1, Conv, [128, 3, 2]] # 1: P2/4 (输入尺寸的1/4，最高分辨率特征层)
  - [-1, 3, C2f, [128, True]] # 2: 浅层C2f特征F_t (论文选定的主要特征源)
  - [-1, 1, DeformablePerceptionModule, [128, 3, 1, 1, 1]] # 3: DCNv3形变感知，输出F_dcn
  - [-1, 1, BGAM, [128]] # 4: BGAM门控清洗，输出高信噪比特征
  - [-1, 1, Conv, [256, 3, 2]] # 5: P3/8 (输入尺寸的1/8)
  - [-1, 6, C2f, [256, True]] # 6: P3 C2f
  - [-1, 1, Conv, [512, 3, 2]] # 7: P4/16 (输入尺寸的1/16)
  - [-1, 6, C2f, [512, True]] # 8: P4 C2f
  - [-1, 1, Conv, [1024, 3, 2]] # 9: P5/32 (输入尺寸的1/32)
  - [-1, 3, C2f, [1024, True]] # 10: P5 C2f
  - [-1, 1, SPPF, [1024, 5]] # 11: SPPF空间金字塔池化

# Head：PAN特征融合结构，保留多尺度检测能力
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 12: 上采样P5到P4尺寸
  - [[-1, 8], 1, Concat, [1]] # 13: 拼接上采样P5和backbone P4
  - [-1, 3, C2f, [512]] # 14: P4融合特征

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 15: 上采样P4到P3尺寸
  - [[-1, 6], 1, Concat, [1]] # 16: 拼接上采样P4和backbone P3
  - [-1, 3, C2f, [256]] # 17: P3融合特征 (小目标检测核心分支)

  - [-1, 1, Conv, [256, 3, 2]] # 18: 下采样P3到P4尺寸
  - [[-1, 14], 1, Concat, [1]] # 19: 拼接下采样P3和head P4
  - [-1, 3, C2f, [512]] # 20: P4融合特征

  - [-1, 1, Conv, [512, 3, 2]] # 21: 下采样P4到P5尺寸
  - [[-1, 11], 1, Concat, [1]] # 22: 拼接下采样P4和backbone SPPF
  - [-1, 3, C2f, [1024]] # 23: P5融合特征

  - [[17, 20, 23], 1, Detect, [nc]] # 24: 检测头，输出P3/P4/P5三个尺度
